package class_;

public class Ex {
	
	
	// main() 자바 프로그램의 시작
	// 단 main() 에서만 가능한 건 아니라
	// main()가 호출하는 다른 메서드에서도 사용은 가능하다
	
	public static void main(String[] args) {
		/*
		 * 절차 지향 프로그래밍
		 * 
		 * 코드의 처음부터 마지막까지 위에서부터 아래로 명령이 수행되는 형태
		 * 특정한 코드가 반복되어 수행된다면 프로그램이 커질뿐 아니라 변경이 되면 모든 부분을 수정해야하는 일이 발생한다
		 * 
		 * >> 한계 발생, 한계 극복 >> 객체 지향
		 * 
		 * 프로그램 내에서 사용되는 연관성이 있는 변수들과 동작(메서드)들을 모아 하나의 개념으로 만들었는데 이를 클래스라고 한다
		 * 
		 * 클래스는 현실 세계의 설계도라고 할 수 있으며 이를 통해 객체(object)를 생성한다
		 * 
		 * 
		 * 
		 * 
		 * 객체 지향 프로그래밍
		 * 
		 * 연관된 속성과 동작을 클래스 형태로 설계하고 이를 통해 여러 개의 객체를 생성하여 필요한 부품을 만들고 이를 조립하는 거대한 프로그래밍
		 * 
		 * 
		 * 객체 지향 프로그래밍의 절차 
		 * 
		 *  1. 요구사항 분석
		 *  2. 클래스의 설계
		 *  3. 설계된 클래스로부터 객체 생성(인스턴스 생성)
		 *  4. 인스턴스를 통한 프로그램 구현
		 *  
		 *  
		 * */
		
		/*
		 * 정의한 클래스는 설계도에 해당하므로 실제 사용을 위해 반드시 실체(=객체)를 생성해야한다
		 * => 클래스를 사용해 메모리에 생성된 객체(실체)를 만들게 되고, 이를 인스턴스(Instance)라고 한다
		 * 
		 * 
		 *  <클래스에 대한 인스턴스 생성 기본 문법>
		 *  
		 *  클래스 변수명 = new 클래스명();
		 *  
		 *  
		 * */
		
		// Animal class의 인스턴스화
		// 1. Animal class 타입 변수 선언
		
		
		
		
		
		
		
		
		
		
		
		
		
		

	} // main

}
